[
    {
      "name": "MyData",
      "media": "iframe",
      "url": "iframe/MyData/index.html",
      "H_min": "900",
      "color": "#025569",
      "beschreiben": "Das war meine Bachelorarbeit, meine favorite Arbeit! <br>Insbesondere die Daten-Visualisiereung.",
      "worktype": "Bachelorarbeit",
      "writer": "Tianheng Wei",
      "time": "Wintersemester 2017-2018",
      "betreuer": "Professoren: Prof. Hartmut Bohnacker, Prof. Benedikt Gross",
      "where": "Hochschule für Gestaltung<br>Schwäbisch Gmünd",
      "titel1": "Kooperationsprojekt mit Daimler AG",
      "inhalt1": "Ich bin von dem Team IDEA in Abteilung IT/HS von Daimler AG beauftragt, diese Aufgabe zu erfüllen. Dies ist keine Teamarbeit. Ich arbeite alleine an dem Projekt, außer den Befragungen und Besprechungen bei Experten und dem Vorgesetzten. Weil dies Projekt ein Auftrag von Abteilung IT/HS ist, und IT/HS sich mit IT-Service für Mitarbeitern beschäftigt, sind die alle Mitarbeiter von der Daimler AG die Zielgruppe. Und für GDPR sind alle EU Bürgern der Gegenstand des Rechtsschutzes. Deswegen sind alle Mitarbeiter von Daimler in EU die Zielgruppe des Projekts.",
      "titel2": "Web-Anwendung für GDPR",
      "inhalt2": "In diesem Projekt ging es um eine Daten Eigentümer zentrale GDPR Lösung im Kontext zwischen Mitarbeiter und Unternehmen.<br>Das Endprodukt ist ein Web Anwendung, mit dieser Web Anwendung kann jeder Mitarbeiter alle Rechte nach der Richtlinien von GDPR ausüben. Beziehungs- weise die erstellte Applikation ermöglicht es, jedem Mitarbeiter entsprechend des Richtlinie GDPR, sich über alle seine persönlichen Daten, den Verarbeitungszweck der Daten und weitere Informationen zu informieren.",
      "titel3": "Erklärung für das Prototyp",
      "inhalt3": "Oben legt das klickbare Prototyp dieses Projekts, das ich mit Hilfe von dem Framework D3.js programmiert habe. Wegen der Geheimshaltung ist der Inhalt generative Fake Daten. Fühlen Sie frei, um den Prototyp zu umspielen. Und vergeben Sie mir, dass nicht alle Funktionen fertig eingebaut wurden.",
      "titel4": "Idee und Konzept",
      "inhalt4": "Diese erstellte Applikation hat zwei Modi, beziehungsweise “Explorer” und “Classic”, damit möglich, dass die unterschiedlichen Nutzergruppen sich die Auswahl entsprechend ihrer Gewohnheiten anpassen können. Und das Layout des “Classic” Moduses besteht aus zwei Bereiche, beziehungsweise die linken Seite für die Daten und rechten Seite für die Applikationen. In den Modus “Classic” kann der User mit alle gewöhnliche Bedienungslogik in einer klassische Darstellung, die aus der Liste der Daten, den Kacheln der Applikationen besteht, die für den User interessante Informationen über Verarbeitungen seiner personenbezogene Daten zu sehen. Die gewöhnliche Funktionen enthält den Filter, das Anordnen, die Suche und die Notifikation und so weiter. <br>In dem Modus “Explorer” kann der User sich durch der Interaktion mit einer interaktive Visualisierung die Verknüpfung zwischen Daten und Applikation und andere gleiche Informationen, wie in dem Modus “Classic”, informieren. Was Besondere von diesem Projekt ist, das hauptsächliche Element in dieser Visualisierung ist das Gesicht, das eine Abbildung des Passbild des Users, aus Punkte. Diese Idee war, mit einer Metapher „digitaler Zwilling“ die Aufmerksamkeit der Nutzern auf die Wichtigkeit von der Personenbezogene Daten zu erwecken. Weil die Element „Gesicht aus Daten“ die Zugehörigkeit der Daten betonen kann. Oder besser gesagt, die Neuerung von diesem Projekt ist nicht nur die Richtlinien des neues Gesetzes GDPR zu erfüllen, sondern auch mit der nachdenkliche und spannende interaktive Visualisierung zum Besuchen der erstellte Applikation zu motivieren. Um die Teilnahme an dem Datenschutz zu erhöhen. Weil in der Analyse den Mangel an Motivation, lange zu benötigen um die Informationen, die aufgrund des Gesetzes transparent werden, zu überprüfen. <br>Um diese Idee des “digitaler Zwilling” besser zu implementieren, wird die Ladezeit der Webseite angemessen ausnutzt. Während der Ladezeit wird eine Animation abspielt. Um den Aufbau von dem Gesicht aus Daten und die Metapher von „Digitaler Zwilling“ zu erklären. Also fliegen die Kreise der Datenfelder von außerhalb des Bildschirms ins Zentrum. Und dann setzen die Kreise das Gesicht des Users zusammen. Und um den Vergleich zwischen dem Gesicht aus weniger Kreise und vielen Kreisen zu zeigen, wird der oben erwähnte Prozess in die drei Teile geschnitten. Mit jedem Teil taucht der entsprechende Text auf. Über dem Gesicht steht die Anzahl der gesammelte Daten, beziehungs- weise von 0 bis jetzige Anzahl. Weil alle EU Bürgern zu unserer Zielgruppe gehört, wird Englisch als Hauptsprache verwendet. Nach der Reihenfolge sind die Texte in der Animation „The more your data is mastered,“, „the clearer you will be for me.“und „Hi, XXX!“. „XXX“ ist der Name des Nutzers.",
      "img1": "img/details/work1/01.png",
      "img2": "img/details/work1/02.png",
      "img3": "img/details/work1/03.jpg",
      "img4": "img/details/work1/04.png"
    },
    {
      "name": "Bakterien auf Handy",
      "media": "video",
      "color": "#907552",
      "beschreiben": "Kinect, Computer Vision und wenige bekante Informationen.",
      "worktype": "Interaktive Kommuniktionssystem",
      "writer": "Carla Lenné<br>Elisa Hasselberg<br>Tianheng Wei",
      "time": "Sommersemester 2016",
      "betreuer": "Julia Stäbler",
      "where": "Hochschule für Gestaltung<br>Schwäbisch Gmünd",
      "titel1": "Natur Museum",
      "inhalt1": "Die Aufgabenstellung war, dass wir ein interaktive Kommunikationssystem konzipieren. Das Thema und die Szene waren offen. Die Interaktion kann das Interesse der Menschen mobilisieren. Deswegen das interaktive Kommunikationssystem wird oft im Museum verwendet. Für die bessere Relevanz haben wir das Natur Museum entschieden.",
      "titel2": "Bakterien auf dem Smartphone",
      "inhalt2": "Viele Leute, insbesondere junge Leute sind so genannte Generation Kopf unten. Aber was wenig bekannt ist, bietet die Wärmemenge von der Batterie des Smartphones geeignete Zuchtbedingungen für Bakterien. Unsere Arbeit war ein Prototyp, das ein Bakterien Detektor für Smartphone simuliert.",
      "titel3": "Konzept",
      "inhalt3": "Information<br>Das Kommunikationssystem wird nicht benutzt, um die Übernutzung des Smartphones zu lösen. Wir möchten nur die Informationen über die häufige mögliche Krankheitserreger auf dem Smartphone verbreiten und einige Reinigung Tipps anbieten.<br><br> Interaktion<br>Der Besucher liegt seines Smartphone auf dem designierten Bereich von der “Petrischale”. Interaktive Modus wir aktiviert. Durch Touch kann er die Informationen durchsehen. Wenn er das Smartphone wegnimmt, wechselt das System in den Standby Modus.<br><br> Animation<br>Im Standby Modus zeigt es ein Guide Animation, die den Besucher auffordert, seines Smartphone auf die “Petrischale” zu liegen. Um das Thema anzupassen, sehen die Transitionen des System wie das Wachstum und das Untergehen der Bakterien. ",
      "titel4": "Aufbau",
      "inhalt4": "Um die riesige interaktive Petrischale(rundes Touchscreen) zu bauen, gleichzeitig das System das Smartphone erkennen zu lassen, haben wir die Konstruktion ausgewählt, die aus Kinect + Rückprojektionsfolie + Beamer besteht.",
      "titel5": "Umsetzung",
      "inhalt5": "Um die Grafikleistungsprobleme und die Kompatibilität für Kinect zu berücksichtigen, habe ich Processing(IDE) und P5.js kombiniert verwendet. Eine grobe Informationsübertragung in der Programmierung: Kinect Lib(Processing) - java.awt.Robot(Processing) - Animation(P5.js).",
      "img1": "img/details/work10/naturmuseum.jpg",
      "img2": "img/details/work10/bah.png",
      "img3": "img/details/work10/conzept.png",
      "img4": "img/details/work10/Aufbau.png",
      "img5": "img/details/work10/processing+p5.png"
    },
    {
      "name": "Kursveränderung",
      "media": "iframe",
      "H_min": "600",
      "url": "iframe/Kursveraenderung/index.html",
      "color": "#7B7D6C",
      "beschreiben": "Eine kleine interakitve Daten-Visualisierung ohne Schrift und Zahl. <br>Interessante Aufgabenstellung.",
      "worktype": "Programmiertes Entwerfen",
      "writer": "Tianheng Wei",
      "time": "Sommersemester 2015",
      "betreuer": "Professoren: Prof. Jens Döring, Prof. Hartmut Bohnacker",
      "where": "Hochschule für Gestaltung<br>Schwäbisch Gmünd",
      "titel1": "Informationstransfers mit Form und Farbe",
      "inhalt1": "Der Schwerpunkt von \"Programmiertes Entwerfen II\" liegt auf der Auseinandersetzung zwischen Form und Farbe in dynamischen Modellen. Eine inhaltliche Umgebung, aus in der Regel, chronologisch definierten Daten, bildet dabei die thematische Grundlage.",
      "titel2": "Warum Thema Devisenkurse",
      "inhalt2": "In diesem Projekt wollte ich untersuchen, die Trends und die miteinandere Verhältnisse von vieler Gruppen der Daten gleichzeitig zu darstellen. Und Devisenkurse hat die Eigenschaften, zum Erst das Merkmal der Daten geeignet ist, außerdem die Datenbank einfach greifbar sind.",
      "titel3": "Erklärung für das Prototyp",
      "inhalt3": "Oben legt das klickbare Prototyp dieses Projekts, das ich mit Programm Sprache Html+CSS+Javascript geschrieben habe. Jedes Element ist Klickbar. Die Punkte repräsentieren verschiedene Währungen, klick zu aktivieren. Wenn mehr als 2 Punkte aktiviert werden, scheint die Linien dazwischen, die den Devisenkurs repräsentieren.<br>Das untere Streifchen jeden Tag in einem Vierteljahr bedeutet. Klick zu markieren, um die Verhältnisse von aller aktivierte Punkte zu zeigen. Sie können auch das Kreis auf dem markiertem Streif klicken, probieren Sie mal, Schaulen mal was passiert.",
      "img1": "img/details/work2/stumme.png",
      "img2": "img/details/work2/thema.png",
      "img3": "img/details/work2/prototyp.png"
    },
    {
      "name": "Chameleon",
      "media": "video",
      "color": "#897E67",
      "beschreiben": "IKS für den Zoo. Das war mein erste IG Projekt..",
      "worktype": "Interaktive Kommunikationssysteme",
      "writer": "Marc Dippon<br>Yijian Lan<br>Tianheng Wei",
      "time": "Wintersemester 2014-2015",
      "betreuer": "Dozent: Dipl.-Des. Roger Walk",
      "where": "Hochschule für Gestaltung<br>Schwäbisch Gmünd",
      "titel1": "Infostand im Zoo",
      "inhalt1": "Dies Projekt ist ein Animation-Prototyp von Informationssystem neben der Chamäleon Aquarium im Zoo. Daraus können wir uns einem kompletem System für den ganzen Zoo vorstellen.",
      "titel2": "low poly style",
      "inhalt2": "Nach der Versuche fanden wir der flache Stil zu abstrakt ist. Und der realitische Stil ist aber unnötig für eines Kommuniktionssystem neben die Aquariumien. Deshalb haben wir auf den low poly stil einigt.",
      "titel3": "Details",
      "inhalt3": "Wir unterteilen die konkrete Infomationen, die durch diesem Informationssystem gezeitgt werden, ins 3 Teile. Anatomie, Verbreitung und Ernährung. Die Dinge außer der Chamäleonen drücken wir mit schlichter Linien und Geometrischer Formen aus. Es macht das Stil von ganze Design eindeutlich, und Chamäleon betont wird.",
      "img1": "img/details/work3/infostand.png",
      "img2": "img/details/work3/lowpoly.png",
      "img3": "img/details/work3/screenshot.png"
    },
    {
      "name": "Penrose-Dreieck",
      "media": "video",
      "color": "#747765",
      "beschreiben": "Virtuell oder Wahr? Face Tracking ermöglicht die eintauchende Erfahrung.",
      "worktype": "3-dim. Grundlagen im medialen Raum",
      "writer": "Marc Dippon<br>Yijian Lan<br>Tianheng Wei",
      "time": "Wintersemester 2014-2015",
      "betreuer": "Professor: Prof. Franklin Hernández-Castro",
      "where": "Hochschule für Gestaltung<br>Schwäbisch Gmünd",
      "titel1": "Dem virtuellen Raum sich überlassen",
      "inhalt1": "Mit der Hilfe das Face-tracking Library von Processing(programm) man dem virtuellen Raum, den wir gebaut haben, sich überlassen zu lassen, war unsere Aufgabe.",
      "titel2": "Kugel und Penrose-Dreieck",
      "inhalt2": "Penrose-Dreieck ist ein klassische raumliche optische Täuschung. Die Täuschung macht unseres Gehirn bemühter den Raum klar zu machen. Andacht macht man sich da überlaseen. Die Kugel im Rohr von Penrose Dreieck läuft, gibt man feedback, ob das Dreieck richtig verbindet wird. Und die bereichert die Elemente.",
      "titel3": "Details",
      "inhalt3": "Es gibt nicht nur Kugel. Für bessere Gefühl von Eintauchen haben wir noch Hintergrund Geräusch, Soundeffekt von Stoss und Hindergrund Bild hinzugefügt. Klick obene Video zu spielen, schaul mal die Arbeit und Ablauf der Entwicklung.",
      "img1": "img/details/work4/virtualroom.jpg",
      "img2": "img/details/work4/kugel.png",
      "img3": "img/details/work4/detail.png"
    },
    {
      "name": "Dropbox Redesign",
      "media": "video",
      "color": "#666666",
      "beschreiben": "UX Verbesserung einer sehr bekanter Applikation.",
      "worktype": "Application Design",
      "writer": "Lukas Karlinger<br>Yibing Ren<br>Tianheng Wei",
      "time": "Wintersemester 2015-2016",
      "betreuer": "Dozent: Jürgen Graef",
      "where": "Hochschule für Gestaltung<br>Schwäbisch Gmünd",
      "titel1": "Warum Dropbox",
      "inhalt1": "Die Aufgabe war es das Design einer bestehenden Smartphone Applikation oder Website zu überarbeiten. Designstudenten benutzen fast jeden Tag Dropbox zum Datenaustausch. Die Dropbox-Webseite ist ein gut gestaltete Plattform mit einem eigenen Stil. Dennoch gibt es Probleme bei der Anwendung.",
      "titel2": "Analyse Methode",
      "inhalt2": "Alle Methoden, die wir angewendet haben, richten sich nach dieser Reihenfolge: 1. Personals SWOT-Analyse Infomationsarchitektur, 2. Kano-Analyse Use-Case und 3. User-Story.",
      "titel3": "Fokusse des Redesigns",
      "inhalt3": "Akkordeon <br>Sobald man Daten im Detail einsehen möchte, wird eine ganze neue Seite geladen. Das kostet Ladezeit und der Nutzer muss zurückgehen, um wieder auf die Seite mit der Dateien-Übersicht zu gelangen. Mit einem nahtlosem Design durch die akkordeon Struktur funktioniert der Seitenwechsel besser.<br><br>Drop-Down-Fenster für Navigation Bread-crumbs <br>Die Bread-crumbs sollen nicht nur den Weg zu den vorherigen Ordner möglich machen, sondern über ein Drop-Down-Fenster auch die im selben Verzeichnis liegenden Ordner anzeigen. Das gibt dem Nutzer einen besseren Überblick.<br><br>Spalt-Darstellung <br>Wir versuchten eine Darstellung in Spalten, wie an den Finder von Mac OS entstanden, in unserem Redesign einzubauen. Das ist eine gute Lösung dafür, wie man schneller die Datei von einem Ordner zu anderen Ordner bewegen will.<br><br>Speicherplatzanzeige <br>Zur Anzeige des freien Speicherplatzes existiert in der aktuellen Version von Dropbox eine Anzeige, welche ein bisschen tief versteckt wird. Hierfür war die Idee an uns, dass eine Füllstandanzeige in Form eines Balkens die gesamte Seite überspannt.",
      "img1": "img/details/work5/dropbox.png",
      "img2": "img/details/work5/analyse.jpg",
      "img3": "img/details/work5/focuses.png"
    },
    {
      "name": "SeeU",
      "media": "video",
      "color": "#626473",
      "beschreiben": "Wie kann Technologie die Welt weiterverkleinern?",
      "worktype": "Invention Design",
      "writer": "Lukas Karlinger<br>Tianheng Wei",
      "time": "Wintersemester 2015-2016",
      "betreuer": "Professor: Prof. Jörg Beck",
      "where": "Hochschule für Gestaltung<br>Schwäbisch Gmünd",
      "titel1": "Video Konferenzsystem",
      "inhalt1": "SeeU ist ein optimiertes Video Konferenzsystem, das folgende Probleme umgeht bzw. löst: Verzerrte Größenverhältnisse durch kleine Bildschirme, Die Unmöglichkeit sich direkt in die Augen sehen zu können und, wenn Inhalte präsentiert werden, stößt die gewöhnliche Videoübertragung meist an ihre Grenzen.",
      "titel2": "Features auf unserem Konzept",
      "inhalt2": "Größenverhältnisse 1:1 <br>Wir brauchten eine große Fläche um den Bildschirm auf zu stellen. Deshalb funktioniert SeeU mittels einer Videowand. Modular Design: die Größe kann man nach Belieben wählen und erweitern. <br><br>Anpassungen in der Paralaxe <br>Um nicht auf die Fläche des Bildschirms schauen zu müssen, sondern in den Raum der Gesprächspartner schauen zu können, testeten wir, ob ein Kameranetz im Bildschirm ein natürlicheres Bild erzeugen kann. Mit glasses-free 3D und Face-tracking Technik entsteht der Eindruck von Paralaxelos. <br><br>Zum Einstellen dieser Technik erarbeiteten wir eine Simulation. Mit einer Kamera schossen wir Fotos aus verschiedenen Perspektiven. Mittels einer Webcam wurde nun die Position des Gesichtes getrackt und ein perspektivisch übereinstimmendes Bild erstellt. <br><br>Augmented Reality <br>Nachdem wir uns auf ein Kameranetz und die Tracking-Technologie festgelegt hatten, eignete sich augmented Reality als vorteilhafteste Methode zur Umsetzung unseres Projekts. Außer als Präsentationshilfe, ist  augmented Reality und SeeU Einsetzbar im Bereich der Familie und des Entertainments.",
      "img1": "img/details/work6/videochat.png",
      "img2": "img/details/work6/wand.png,img/details/work6/parallaxe.gif,img/details/work6/prufung.gif,img/details/work6/argument.png"
    },
    {
      "name": "Thermostat",
      "media": "video",
      "color": "#5A5A5A",
      "beschreiben": "Eine gute Übung für das Interface Design in Bildschirm mit ungewöhnlichem Form.",
      "worktype": "Usability & Interface Design",
      "writer": "Anh Tuan Ha<br>Barend Visser<br>Yijian Lan<br>Tianheng Wei",
      "time": "Wintersemester 2014-2015",
      "betreuer": "Dozent: Thomas Techert",
      "where": "Hochschule für Gestaltung<br>Schwäbisch Gmünd",
      "titel1": "Häuslicher intelligenter Thermostat",
      "inhalt1": "Viel Energie wird durch Heizungungen verschwendet, diese laufen, auch wenn keiner zuhause ist. Ein smartes Thermostat kann die Heizung automatisch ausschalten, wenn Sie das Haus verlassen und vor dem Zurückkehren wieder einschalten.",
      "titel2": "Formgestaltung",
      "inhalt2": "Da wir die Gestaltung bei den Skizzen eher nach der Funktion ausgelegt haben, entschieden wir nun eine abstrakte Form für den Thermometer zu wählen. Somit erfüllt dieser eine gewisse Erwartungskonformität, um den Nutzer die Funktionen eines Thermometers optisch zu vermitteln.",
      "titel3": "Screen Designs",
      "inhalt3": "Screengestaltung<br>Um ein schlichtes Design zu bekommen, verwendeten wir Ellipsen als Grun- delemnte und ordneten den Ellipsen eine Farbe zu, welche sich dann in den tieferen Ebenen wiederholen. <br><br>Heizen<br>Durch das Tippen auf der großen Ellipse des Hauptscreens, hat man die Möglichkeit die Temeratur des jeweils angewählten Zimmers zu regulieren. Zu sehen ist der momentane Zustand und die Temperatur. <br><br>Verbrauch<br>Gekennzeichnet durch verschiedene kleine Ellipsen die sich in ihrer Farbe und Kontur mit den darüber liegenden Jahreszahlen gleichen, sehen wir den Verbrauch von Januar bis Februar. Durch Antippen erhalten wir nähere Informationen. So auch bei dem Wechsel zu den Kosten. <br><br>Räume<br>In einer Zeit- und Temperaturachse kann der Nutzer nun eine Kurve ziehen und durch Antippen auf die jeweiligen Punkte in die Detailansicht wechseln. Das ganze bestätigt man wieder mit der grünen Ellipse oder bricht alles mit der roten ab. <br><br>Einstellungen<br>Durch das Akkordeonprinzip ziehen sich die Linien bei dem jeweils angetippten Menüpunkt auf oder zu. Dadurch gewinnt der Screen an Übersichtlichkeit. Alles  kann mit der roten Ellipse abgebrochen werden. <br><br>Wetter<br>Im Screen \"Wetter\" ist lediglich der Wechsel zwischen Stunden und Tagen möglich. Die Informationen bekommt das Gerät über das Wlan Netz.",
      "img1": "img/details/work7/energie.png",
      "img2": "img/details/work7/form.jpg",
      "img3": "img/details/work7/screens.png"
    },
    {
      "name": "Vardant",
      "media": "iframe",
      "color": "#283F50",
      "beschreiben": "3D Modelling ist ein von meiner Hobbys.",
      "H_min": "600",
      "url": "https://sketchfab.com/models/aeb15df0881542efa5ff70c9053f4e88/embed",
      "worktype": "3D modelling",
      "writer": "Tianheng Wei",
      "time": "Freizeit im 2013",
      "titel1": "Was ist Vardant",
      "inhalt1": "Vardant ist ein mechanischer Panzer mit menschlicher Form aus einem japanischem Comic \"Kurogane no Linebarrels\". Das interaktive 3D-Modell oben, stellt einen Teil von Vardant dar.",
      "titel2": "Modelling",
      "inhalt2": "Rhino (3d modelling Software) besitzt hervorragende Leistung wegen NURBS. Da das Modell präziser werden sollte, wählte ich Rhino als mein modelling Tool.",
      "titel3": "Texture and Lighting",
      "inhalt3": "Für die Textur und Belichtung habe ich C4D verwendet. Eine realistische Simulation der Beleuchtung durch den Himmel ist gut geeignet für ein großes Objekt wie einen mechanischen Panzer.",
      "titel4": "Interaktive",
      "inhalt4": "Mit einer Webseite, die Sketchfab heißt, kann man 3d-Modelle im Internet zeigen, und in seiner Webseite einbetten. Schauen Sie oben!",
      "img1": "img/details/work8/comic.png",
      "img2": "img/details/work8/interaktive.png",
      "img3": "img/details/work8/lighting.png",
      "img4": "img/details/work8/rhino.png"
    },
    {
      "name": "Light Tracker",
      "media": "video",
      "color": "#506F70",
      "beschreiben": "Mein lieblings Workshop war Mechatronik-Workshop. <br>Ich war darauf stolz, dass ich der Erster war, wer funktionierten Code programmiert. :)",
      "worktype": "Mechatronik Workshop",
      "writer": "Bruno Hornung<br>Yibing Ren<br>Tianheng Wei",
      "time": "Sommersemster 2016",
      "betreuer": "Professor: Prof. Franz Biggel",
      "where": "Hochschule für Gestaltung<br>Schwäbisch Gmünd",
      "titel1": "Aufgabenstellung",
      "inhalt1": "Das Ziel war, dass mit einem vorhanden mechanischem Sockel, Lichtsensoren, elektronischer Bauteile (Transistor, Relais) und einem Arduino Board eine automatische Maschine gebaut wird, die den hellsten Punkt im Raum finden kann.",
      "titel2": "Elektro-Wissen popularisieren",
      "inhalt2": "Der Professor lehrte uns die Basis elektronischer Kenntnisse. So konnten wir die die Kabel richtig vernetzen.",
      "titel3": "Programierung",
      "inhalt3": "Schreiben ,Testen, Umschreiben... dieser Ablauf dauerte einen Tag lang, dann war ich fertig! Das finale Ergebnis war, ein Echtzeitligtracking mit 4 Lichtsensoren und 100 Zeilen Code.",
      "img1": "img/details/work9/erkenntnis.png",
      "img2": "img/details/work9/light.png",
      "img3": "img/details/work9/loop.png"
    },
    {
      "name": "Iris",
      "media": "video",
      "color": "#105D77",
      "beschreiben": "Ein Endprodukt ohne visuellem Interface. Das gabt noch nie in der Geschichte der HfG.",
      "worktype": "Sprache Assistent Desgin",
      "writer": "Bruno Hornung<br>Maurice Wichert<br>Tianheng Wei",
      "time": "Sommersemster 2017",
      "betreuer": "Betreuern: Prof. David Oswald, Florian Geiselhart",
      "where": "Hochschule für Gestaltung<br>Schwäbisch Gmünd",
      "titel1": "Konfiguration",
      "inhalt1": "Das User-centered Design ermöglicht, dass wir die Nutzern besser verstehen und Nutzer geeignete Produkt herstellen. Aber normalerweise können wir nicht alle potentielle Nutzern in den Designprozess einladen. Obwohl so wir könnten, verändert sich der Gedanke des Nutzers immer. Deswegen ist eine Konfiguration Funktion notwendig.",
      "titel2": "Smart Speaker",
      "inhalt2": "Das Smarthome macht unseres Leben einfacher. Und das wird populärer, wenn der Smart Speaker in den Market eintritt. Weil jeder verschiedene Gewohnheit und unterschiedliche Elektrogeräte hat, ist die Konfiguration Funktion am wichtigst. In der jetzige Smarthome Applikationen kann man nur mit dem Smartphone konfigurieren. Warum kann man nicht einfach mit Sprache, das intuitivstes Kommunikationsmittel, die Applikation konfigurieren?",
      "titel3": "Konzept von Iris",
      "inhalt3": "Iris ist ein mit Dialog konfigurierbar Sprache Assistent. Die biologische Bedeutung von der Iris andeutet auch, dass der Nutzer keine Auge zu benutzen braucht. Was lustig ist, der Name “Iris” hat zufällig die Umgekehrte Buchstabieren Reihenfolge von “Siri”.<br><br>Sprachbefehl<br>Ein Sprachbefehl funktioniert wie Befehle Set, damit man die beliebige Befehle gruppieren kann und ein individualisierte Name geben kann. Zum Beispiel, wenn der Nutzer “movie time” sagt, schalt der Assistent das Licht aus, den Fernseher ein und macht den Rolladen runter. <br><br>Vernetzung <br>Eine Vernetzung ist grundsätzlich die Verbindung zwischen Sensors und Geräte. Wenn die Werte von Sensors eine Voraussetzung erfüllt, führen die Geräte die entsprechende Aktionen aus. Zum Beispiel wie in oberem Video, wenn draußen dunkel wird, wird der Assistent das Licht ausschalten. <br><br>Aktive Anfrage <br>Es ist keine gute Erfahrung, wenn man jede Einstellung selbst machen muss. Ein Smart Speaker soll kluger sein. Durch Beobachtung auf den Nutzer und Vergleich mit der Big Data soll der Assistent in der large sein, um die nützliche Vernetzung zur richtigen Zeit zu empfehlen. Z.b. wenn man drei drauffolgende Tagen bei Durchführen der gleiche Vernetzung das Licht ausschaltete, fragt der Assistent “Soll ich immer so machen?”.",
      "titel4": "Interaktivbare Prototyp",
      "inhalt4": "Um einen interaktivere Prototyp zu realisieren, habe ich die Amazon Alexa Develop Pool, Particle Chip “Photon” und Particle.io Service verwendet. Alle Logik der Interaktion habe ich auf javascript in eine Test Version einer Alexa Skill eingebaut. Das Daten Übermitteln zwischen AWS und Particle.io habe ich ein Package “alexaParticleBridge” verwendet. Danke für die Copyright (c) 2016 Ron Lisle in MIT.",
      "titel5": "Ausstellung",
      "inhalt5": "Eine wichtige Prozess von das User-centered Designs ist Sammlung der Feedbacks während der Testing des Users. Die Semesterausstellung ist auch eine gute Gelegenheit, die Meinungen von der Zuschauern zu sammeln.",
      "img1": "img/details/work11/configurieren.png",
      "img2": "img/details/work11/smartspeaker.png",
      "img3": "img/details/work11/konzept.gif",
      "img4": "img/details/work11/modell.png",
      "img5": "img/details/work11/ausstellung.jpg"
    }
]