[
  {
    "name": "MyData",
    "media": "iframe",
    "url": "iframe/MyData/index.html",
    "H_min": "900",
    "color": "#025569",
    "beschreiben": "This was my bachelor thesis, my favorite work! <br>Especially the data visualization.",
    "worktype": "Bachelor thesis",
    "writer": "Tianheng Wei",
    "time": "Winter semester 2017-2018",
    "betreuer": "Professors: Prof. Hartmut Bohnacker, Prof. Benedikt Gross",
    "where": "University of Design<br>Schwäbisch Gmünd",
    "titel1": "Cooperation project with Daimler AG",
    "inhalt1": "I am assigned by team IDEA in department IT/HS of Daimler AG to perform this task. This is not team work. I work alone on the project, except for the interviews and meetings with experts and the supervisor. Because this project is an order from IT/HS department, and IT/HS deals with IT service for employees, all Daimler AG employees are the target group. And for GDPR all EU citizens are the subject of legal protection. Therefore, all Daimler employees in EU are the target group of the project.",
    "titel2": "Web application for GDPR",
    "inhalt2": "This project was about a data owner central GDPR solution in the context between employee and company.<br>The final product is a web application, with this web application each employee can exercise all rights according to the guidelines of GDPR. In relation, the created application allows each employee to be informed about all their personal data, the purpose of processing the data and other information according to the policy GDPR.",
    "titel3": "Explanation for the prototype",
    "inhalt3": "Above is the clickable prototype of this project, which I programmed using the framework D3.js. Due to secrecy the content is generative fake data. Feel free to play around with the prototype. And forgive me that not all functions are built in.",
    "titel4": "Idea and concept",
    "inhalt4": "This created application has two modes, respectively \"Explorer\" and \"Classic\", so that different groups of users can adapt their choices according to their habits. And the layout of \"Classic\" mode consists of two areas, respectively, left side for data and right side for applications. In the \"Classic\" mode, the user can see information of interest to the user about the processing of their personal data using all the usual operating logic in a classic display consisting of a list of data and application tiles. The common functions include filter, arrange, search and notification and so on. <br>In the \"Explorer\" mode, the user, interacting with an interactive visualization, can find out the link between the data and the application and other similar information as in the \"Classic\" mode. What is special about this project, the main element in this visualization is the face, which is an image of the user's passport photo, made of dots. This idea was to draw users' attention to the importance of Personal Data using a \"digital twin\" metaphor. Because the Face of Data element can emphasize the belongingness of the data. Or rather, the novelty of this project is not only to meet the guidelines of the new GDPR law, but also to motivate visitors to visit the created application with thoughtful and exciting interactive visualization. To increase participation in data protection. Because in the analysis, the lack of motivation to take a long time to verify the information that becomes transparent due to the law. <br>In order to better implement this idea of ​​the \"digital twin\", the loading time of the website is used appropriately. An animation will play during the loading time. To explain the construction of the data face and the metaphor of \"digital twin\". So the circles of the data fields fly in from the off-screen to the center. And then the circles compose the user's face. And to show the comparison between the face of fewer circles and many circles, the process mentioned above is cut into the three parts. The corresponding text appears with each part. Above the face is the number of collected data, or from 0 to the current number. Because all EU citizens are part of our target group, English is used as the main language. In order, the texts in the animation are \"The more your data is mastered,\" \"the clearer you will be for me.\" and \"Hi, XXX!\". \"XXX\" is the user's name.",
    "img1": "assets/img/details/work1/01.png",
    "img2": "assets/img/details/work1/02.png",
    "img3": "assets/img/details/work1/03.jpg",
    "img4": "assets/img/details/work1/04.png"
  },
  {
    "name": "Bacteria on smartphone",
    "media": "video",
    "color": "#907552",
    "beschreiben": "Kinect, computer vision and few known information.",
    "worktype": "Interactive communication system",
    "writer": "Carla Lenné<br>Elisa Hasselberg<br>Tianheng Wei",
    "time": "Summer semester 2016",
    "betreuer": "Julia Stäbler",
    "where": "University of Design<br>Schwäbisch Gmünd",
    "titel1": "Nature Museum",
    "inhalt1": "The task was that we design an interactive communication system. The theme and the scene were open. The interaction can mobilize people's interest. That is why the interactive communication system is often used in the museum. For the better relevance we have chosen the nature museum.",
    "titel2": "Bacteria on smartphone",
    "inhalt2": "Many people, especially young people are so-called generation head down. But what is little known, the amount of heat from the battery of the smartphone provides suitable breeding conditions for bacteria. Our work was a prototype that simulates a bacteria detector for smartphone.",
    "titel3": "Concept",
    "inhalt3": "Information<br>The communication system is not used to solve the overuse of the smartphone. We just want to spread the information about common possible pathogens on the smartphone and offer some cleaning tips.<br><br> Interaction<br>Visitor places his smartphone on the designated area of ​​the \"petri dish\". Interactive mode is activated. He can look through the information by touch. When he takes away the smartphone, the system switches to standby mode.<br><br> Animation<br>In standby mode, it shows a guide animation that asks the visitor to put his smartphone on the \"petri dish\". To fit the theme, see the transitions of the system as the growth and death of bacteria.",
    "titel4": "Structure",
    "inhalt4": "To build the huge interactive petri dish(round touch screen), at the same time let the system recognize the smartphone, we have chosen the construction which consists of Kinect + rear projection film + beamer.",
    "titel5": "Implementation",
    "inhalt5": "To address graphics performance issues and compatibility for Kinect, I used Processing(IDE) and P5.js combined. A rough information transfer in programming: Kinect Lib(Processing) - java.awt.Robot(Processing) - Animation(P5.js).",
    "img1": "assets/img/details/work10/naturmuseum.jpg",
    "img2": "assets/img/details/work10/bah.png",
    "img3": "assets/img/details/work10/conzept.png",
    "img4": "assets/img/details/work10/Aufbau.png",
    "img5": "assets/img/details/work10/processing+p5.png"
  },
  {
    "name": "Price change",
    "media": "iframe",
    "H_min": "600",
    "url": "iframe/Kursveraenderung/index.html",
    "color": "#7B7D6C",
    "beschreiben": "A small interactive data visualization without font and number. <br>Interesting task.",
    "worktype": "Programmed design",
    "writer": "Tianheng Wei",
    "time": "Summer semester 2015",
    "betreuer": "Professors: Prof. Jens Döring, Prof. Hartmut Bohnacker",
    "where": "University of Design<br>Schwäbisch Gmünd",
    "titel1": "Information transfers with form and color",
    "inhalt1": "The focus of \"Programmed Design II\" is on the confrontation between form and color in dynamic models. A content environment, usually consisting of chronologically defined data, forms the thematic basis.",
    "titel2": "Why theme exchange rates",
    "inhalt2": "In this project I wanted to study the trends and the interrelationships of many groups of data simultaneously. And foreign exchange rates has the properties to first the feature of the data is suitable, moreover the database are easily tangible.",
    "titel3": "Explanation for the prototype",
    "inhalt3": "Above lays the clickable prototype of this project which I wrote using program language Html+CSS+Javascript. Every element is clickable. The dots represent different currencies, click to activate. If more than 2 points are activated, the lines between them, representing the exchange rate, appear.<br>The lower bar means each day in a quarter. Click to highlight to show the ratios of all checked points. You can also click the circle on the marked strip, try it, see what happens.",
    "img1": "assets/img/details/work2/stumme.png",
    "img2": "assets/img/details/work2/thema.png",
    "img3": "assets/img/details/work2/prototyp.png"
  },
  {
    "name": "Chameleon",
    "media": "video",
    "color": "#897E67",
    "beschreiben": "ICS for the zoo. This was my first IG project...",
    "worktype": "Interactive communication systems",
    "writer": "Marc Dippon<br>Yijian Lan<br>Tianheng Wei",
    "time": "Winter semester 2014-2015",
    "betreuer": "Lecturer: Dipl.-Des. Roger Walk",
    "where": "University of Design<br>Schwäbisch Gmünd",
    "titel1": "Information stand at the zoo",
    "inhalt1": "This project is an animation prototype of information system next to the chameleon aquarium in the zoo. From this we can imagine a complete system for the whole zoo.",
    "titel2": "low poly style",
    "inhalt2": "After the tests we found the flat style is too abstract. And the realistic style is unnecessary for a communication system next to the aquariums. That's why we agreed on the low poly style.",
    "titel3": "Details",
    "inhalt3": "We divide the concrete information provided by this information system into 3 parts. Anatomy, distribution and nutrition. We express the things except chameleons with simple lines and geometric shapes. It makes the style of whole design clear, and chameleon is emphasized.",
    "img1": "assets/img/details/work3/infostand.png",
    "img2": "assets/img/details/work3/lowpoly.png",
    "img3": "assets/img/details/work3/screenshot.png"
  },
  {
    "name": "Penrose triangle",
    "media": "video",
    "color": "#747765",
    "beschreiben": "Virtual or True? Face tracking enables the immersive experience.",
    "worktype": "3-dim. bases in medial space",
    "writer": "Marc Dippon<br>Yijian Lan<br>Tianheng Wei",
    "time": "Winter semester 2014-2015",
    "betreuer": "Professor: Prof. Franklin Hernández-Castro",
    "where": "University of Design<br>Schwäbisch Gmünd",
    "titel1": "Surrendering to virtual space",
    "inhalt1": "With the help of the face-tracking library of Processing(program), to let one surrender to the virtual space we built was our task.",
    "titel2": "Sphere and Penrose triangle",
    "inhalt2": "Penrose triangle is a classic spatial optical illusion. The illusion makes our brain try harder to make the space clear. It makes you think about it. The sphere running in the tube of Penrose triangle gives feedback whether the triangle is correctly connected. And that enriches the elements.",
    "titel3": "Details",
    "inhalt3": "There is not only ball. For better feeling of immersion we have added background noise, sound effect of impact and background image. Click above video to play, see the work and process of development.",
    "img1": "assets/img/details/work4/virtualroom.jpg",
    "img2": "assets/img/details/work4/kugel.png",
    "img3": "assets/img/details/work4/detail.png"
  },
  {
    "name": "Dropbox Redesign",
    "media": "video",
    "color": "#666666",
    "beschreiben": "UX improvement of a very popular application.",
    "worktype": "Application Design",
    "writer": "Lukas Karlinger<br>Yibing Ren<br>Tianheng Wei",
    "time": "Winter semester 2015-2016",
    "betreuer": "Lecturer: Jürgen Graef",
    "where": "University of Design<br>Schwäbisch Gmünd",
    "titel1": "Why Dropbox",
    "inhalt1": "The task was to revise the design of an existing smartphone application or website. Design students use Dropbox almost every day to share data. The Dropbox website is a well-designed platform with its own style. Nevertheless, there are problems with the application.",
    "titel2": "Analysis method",
    "inhalt2": "All the methods we have used follow this order: 1. personnel SWOT analysis infomation architecture, 2. Kano analysis use case and 3. user story.",
    "titel3": "Focuses of the redesign",
    "inhalt3": "Accordion <br>As soon as you want to see data in detail, a whole new page will be loaded. This costs loading time and the user has to go back to get back to the files overview page. Page switching works better with a seamless design thanks to the accordion structure.<br><br>Drop-down window for navigation Bread-crumbs <br>The bread-crumbs should not only make the path to the previous folder possible, but via a drop-down window also show the folders in the same directory. This gives the user a better overview.<br><br>Gap display <br>We tried to incorporate a display in columns, as created in the Mac OS Finder, in our redesign. This is a good solution for how to move files from one folder to another faster.<br><br>Disk space indicator <br>In the current version of Dropbox there is a display of free disk space, which is a bit deep is hidden. The idea we had for this was that a level indicator in the form of a bar spans the entire page.",
    "img1": "assets/img/details/work5/dropbox.png",
    "img2": "assets/img/details/work5/analyse.jpg",
    "img3": "assets/img/details/work5/focuses.png"
  },
  {
    "name": "SeeU",
    "media": "video",
    "color": "#626473",
    "beschreiben": "How can technology make the world even smaller?",
    "worktype": "Invention Design",
    "writer": "Lukas Karlinger<br>Tianheng Wei",
    "time": "Winter semester 2015-2016",
    "betreuer": "Professor: Prof. Jörg Beck",
    "where": "University of Design<br>Schwäbisch Gmünd",
    "titel1": "Video conference system",
    "inhalt1": "SeeU is an optimized video conferencing system that avoids or solves the following problems: distorted proportions due to small screens, the impossibility to look each other directly in the eye and, when content is presented, ordinary video transmission usually reaches its limits.",
    "titel2": "Features on our concept",
    "inhalt2": "1:1 Size Ratios <br>We needed a large area to put the screen on. That's why SeeU works by means of a video wall. Modular design: you can choose and expand the size at will. <br><br>Adjustments in the parallax <br>In order not to have to look at the surface of the screen, but to be able to look into the room of the interlocutor, we tested whether a camera network in the screen could produce a more natural image. With glasses-free 3D and face-tracking technology, the impression of paralaxelos is created. <br><br>To set up this technique, we developed a simulation. With a camera we shot photos from different perspectives. The position of the face was then tracked using a webcam and an image with the same perspective was created. <br><br>Augmented Reality <br>Once we settled on a camera network and the tracking technology, augmented reality was the most beneficial way to implement our project. Besides being a presentation aid, augmented reality and SeeU can be used in the area of ​​family and entertainment.",
    "img1": "assets/img/details/work6/videochat.png",
    "img2": "assets/img/details/work6/wand.png,img/details/work6/parallaxe.gif,img/details/work6/prufung.gif,img/details/work6/argument.png"
  },
  {
    "name": "Thermostat",
    "media": "video",
    "color": "#5A5A5A",
    "beschreiben": "A good exercise for interface design in screen with unusual shape.",
    "worktype": "Usability & Interface Design",
    "writer": "Anh Tuan Ha<br>Barend Visser<br>Yijian Lan<br>Tianheng Wei",
    "time": "Winter semester 2014-2015",
    "betreuer": "Lecturer: Thomas Techert",
    "where": "University of Design<br>Schwäbisch Gmünd",
    "titel1": "Home smart thermostat",
    "inhalt1": "A lot of energy is wasted by heaters, they run even when no one is home. A smart thermostat can automatically turn off the heating when you leave the house and turn it on again before you return.",
    "titel2": "ShSince we designed the sketches more according to function, we decided to choose an abstract form for the thermometer. Thus, this fulfills a certain expectation conformity to visually convey the functions of a thermometer to the user.",
    "inhalt2": "",
    "titel3": "Screen Designs",
    "inhalt3": "Screen design<br>In order to get a simple design, we used ellipses as basic elements and assigned a color to the ellipses, which is then repeated in the deeper levels. <br><br>Heating<br>By tapping on the large ellipse on the main screen, you have the option of regulating the temperature of the selected room. You can see the current status and the temperature. <br><br>Consumption<br>Characterized by various small ellipses that are the same in color and contour as the year numbers above them, we see the consumption from January to February. By tapping we get more information. So also with the change to the costs. <br><br>Rooms<br>The user can now draw a curve on a time and temperature axis and switch to the detailed view by tapping on the respective points. You confirm the whole thing again with the green ellipse or cancel everything with the red one. <br><br>Settings<br>Due to the accordion principle, the lines open or close each time the menu item is tapped. This improves the screen's clarity. Everything can be canceled with the red ellipse. <br><br>Weather<br>On the \"Weather\" screen it is only possible to switch between hours and days. The device receives the information via the WLAN network.",
    "img1": "assets/img/details/work7/energie.png",
    "img2": "assets/img/details/work7/form.jpg",
    "img3": "assets/img/details/work7/screens.png"
  },
  {
    "name": "Vardant",
    "media": "iframe",
    "color": "#283F50",
    "beschreiben": "3D modeling is one of my hobbies.",
    "H_min": "600",
    "url": "https://sketchfab.com/models/aeb15df0881542efa5ff70c9053f4e88/embed",
    "worktype": "3D modelling",
    "writer": "Tianheng Wei",
    "time": "Free time in 2013",
    "titel1": "What is Vardant",
    "inhalt1": "Vardant is a mechanical tank with a human shape from a Japanese comic book \"Kurogane no Linebarrels\". The interactive 3D model above, represents a part of Vardant.",
    "titel2": "Modelling",
    "inhalt2": "Rhino (3d modeling software) has excellent performance because of NURBS. Since I wanted the model to be more accurate, I chose Rhino as my modeling tool.",
    "titel3": "Texture and Lighting",
    "inhalt3": "For the texture and exposure I used C4D. A realistic simulation of the lighting through the sky is well suited for a large object like a mechanical tank.",
    "titel4": "Interactive",
    "inhalt4": "With a website called Sketchfab, you can show 3d models on the internet, and embed them in your website. Look above!",
    "img1": "assets/img/details/work8/comic.png",
    "img2": "assets/img/details/work8/interaktive.png",
    "img3": "assets/img/details/work8/lighting.png",
    "img4": "assets/img/details/work8/rhino.png"
  },
  {
    "name": "Light Tracker",
    "media": "video",
    "color": "#506F70",
    "beschreiben": "My favorite workshop was mechatronics workshop. <br>I was proud that I was the first to program working code. :)",
    "worktype": "Mechatronics Workshop",
    "writer": "Bruno Hornung<br>Yibing Ren<br>Tianheng Wei",
    "time": "Summer semester 2016",
    "betreuer": "Professor: Prof. Franz Biggel",
    "where": "University of Design<br>Schwäbisch Gmünd",
    "titel1": "Task",
    "inhalt1": "The goal was that with an existing mechanical socket, light sensors, electronic components (transistor, relay) and an Arduino board, an automatic machine would be built that could find the brightest spot in the room.",
    "titel2": "Popularize electrical knowledge",
    "inhalt2": "The professor taught us the basics of electronic knowledge. So we were able to network the cables correctly.",
    "titel3": "Programming",
    "inhalt3": "Writing, testing, rewriting... this process took one day, then I was done! The final result was a real-time light tracking with 4 light sensors and 100 lines of code.",
    "img1": "assets/img/details/work9/erkenntnis.png",
    "img2": "assets/img/details/work9/light.png",
    "img3": "assets/img/details/work9/loop.png"
  },
  {
    "name": "Iris",
    "media": "video",
    "color": "#105D77",
    "beschreiben": "A final product without a visual interface. This has never happened before in the history of the HfG.",
    "worktype": "Language Assistant Desgin",
    "writer": "Bruno Hornung<br>Maurice Wichert<br>Tianheng Wei",
    "time": "Summer semester 2017",
    "betreuer": "Betreuern: Prof. David Oswald, Florian Geiselhart",
    "where": "University of Design<br>Schwäbisch Gmünd",
    "titel1": "Configuration",
    "inhalt1": "The user-centered design allows us to better understand the users and make users suitable product. But usually we cannot invite all potential users into the design process. Although we could do so, the user's thought always changes. Therefore, a configuration function is necessary.",
    "titel2": "Smart Speaker",
    "inhalt2": "The smarthome makes our life easier. And it will be more popular when the smart speaker enters the market. Because everyone has different habits and different electric devices, the configuration function is the most important. In the current smart home applications, you can only configure with your smartphone. Why can't you simply configure the application with voice, the most intuitive means of communication?",
    "titel3": "Concept of Iris",
    "inhalt3": "Iris is a dialog configurable voice assistant. The biological importance of the iris also implies that the user does not need to use eyes. What's funny, the name \"Iris\" happens to have the reverse spelling order of \"Siri\".<br><br>Voice command<br>A voice command works like Commands Set, so you can group any command and a can give individualized name. For example, when the user says \"movie time\" the assistant turns off the lights, turns on the TV, and lowers the blinds. <br><br>Networking <br>Networking is basically the connection between sensors and devices. If the values ​​of Sensors meet a requirement, the devices take the appropriate actions. For example like in the video above, when it gets dark outside, the assistant will turn off the light. <br><br>Active request <br>It's not a good experience when you have to do every setting yourself. A smart speaker should be smarter. By observing the user and comparing it with the big data, the assistant should be in the large to recommend useful networking at the right time. E.g. if you turn off the light three consecutive days while performing the same meshing, the wizard will ask \"Should I always do this?\".",
    "titel4": "Interactive Prototype",
    "inhalt4": "To realize a more interactive prototype, I used the Amazon Alexa Develop Pool, Particle Chip \"Photon\" and Particle.io service. All the interaction logic I built on javascript in a test version of an Alexa skill. The data transfer between AWS and Particle.io I used a package \"alexaParticleBridge\". Thanks for the copyright (c) 2016 Ron Lisle in MIT.",
    "titel5": "Exhibition",
    "inhalt5": "An important process of the user-centered designs is collecting the feedbacks during the user's testing. The semester exhibition is also a good opportunity to collect the opinions from the viewers.",
    "img1": "assets/img/details/work11/configurieren.png",
    "img2": "assets/img/details/work11/smartspeaker.png",
    "img3": "assets/img/details/work11/konzept.gif",
    "img4": "assets/img/details/work11/modell.png",
    "img5": "assets/img/details/work11/ausstellung.jpg"
  }
]
